<?php

// передача по ссылке

class Cat{
    public $name;
    public $color;
}

// типичный серенький британец
$cat1 = new Cat();
$cat1->name = 'Murzik';
$cat1->color = 'Grey';

// хочу второго британца, но чтобы имя было другое
$cat2 = $cat1;
$cat2->name = 'Aaron';

var_dump(
    [
        $cat1->name,// Aaron
        $cat2->name // Aaron
    ]
);

// ВЫВОД:
// При передачи по значению мы работаем ИМЕННО с оригинальным значением
// Итого 2 кота Aaron((











//======================================================================================================================
// пример 2

$a2 = 1;

function x2(&$data)
{
    $data++;
}

