<?php

// Ковариантность и Контравариантность

// 1. Ковариантность позволяет дочернему методу возвращать более конкретный тип,
// чем тип возврата его родительского метода.
// В наследнике мы как бы уточняем информацию

// 2. Контравариантность позволяет дочернему методу возвращать менее конкретный тип,
// чем тип возврата его родительского метода.
// В наследнике мы как бы уменьшаем уточнение информацию

// пример ковариантности
class X
{
    public function q(): object
    {

    }
}

class X2 extends X{
    public function q(): DateTime
    {

    }
}


// пример контравариантность
class A
{
    public function q(DateTime $q): object
    {

    }
}

class A2 extends A{
    public function q(object $q): DateTime
    {

    }
}